import { useEffect } from "react";
import './privacy_policy_page.scss';

export const PrivacyPolicyPage = () => {

  //? Cleanup effect to reset scroll position when component unmounts
  useEffect(() => {
    return () => {
      window.scroll({ top: 0, behavior: 'auto' });
    };
  }, []);

    return (
      <div className="privacy_policy_page">
        
        <div className="privacy_policy_page__title">
          Политика за поверителност на 
          <span className="privacy_policy_page__title--disaster">DISASTER</span>
          <span className="privacy_policy_page__title--scout">SCOUT</span>
        </div>

        <div className="privacy_policy_page__info-container"> 
           <div className="privacy_policy_page__info-container--p">Чл. 1. (1) Настоящите правила (Правилата) определят реда, по който Disaster Scout събира, записва, организира, структурира, съхранява, адаптира или променя, извлича, консултира, използва, разкрива чрез предаване, разпространяване или друг начин, по който данните стават достъпни, подрежда или комбинира, ограничава, изтрива, унищожава или обработва по друг начин лични данни за целите на своята дейност.</div>
        
           <div className="privacy_policy_page__info-container--p">(2) В зависимост от конкретната ситуация, Disaster Scout може да обработва данни в качеството на администратор или обработващ лични данни.</div>
        
           <div className="privacy_policy_page__info-container--p">(3) Правилата са изготвени в съответствие с изискванията на Регламент (ЕС) 2016/679 на Европейския Парламент и на Съвета от 27 април 2016 г. относно защитата на физическите лица във връзка с обработването на лични данни и относно свободното движение на такива данни и за отмяна на Директива 95/46/EО (Общ регламент относно защитата на данните).</div>
        
           <div className="privacy_policy_page__info-container--p">Чл. 2. Настоящите ПРАВИЛА уреждат:</div>

           <div className="privacy_policy_page__info-container--p">(1) Принципите, процедурите и механизмите за обработка на личните данни;</div>
           <div className="privacy_policy_page__info-container--p">(2) Процедурите за уведомяване на надзорния орган в случай на нарушения в сигурността;</div>
           <div className="privacy_policy_page__info-container--p">(3) Процедурите за администриране на искания за достъп до данни, коригиране на обработваните данни, възражения и оттегляне на съгласия, както и администриране на искания за упражняване на други права, които субектите на лични данни имат по закон;</div>
           <div className="privacy_policy_page__info-container--p">(4) Лицата, които обработват лични данни, и техните задължения;</div>
           <div className="privacy_policy_page__info-container--p">(5) Правилата за предаване на лични данни на трети лица в България и чужбина;</div>
           <div className="privacy_policy_page__info-container--p">(6) Необходимите технически и организационни мерки за защита на личните данни от неправомерно обработване и в случай на инциденти, като случайно или незаконно унищожаване, загуба, неправомерен достъп, изменение или разпространение;</div>
           <div className="privacy_policy_page__info-container--p">(7) Техническите ресурси, прилагани при обработката на лични данни.</div>







           <div className="privacy_policy_page__info-container--p--bolditalic">
           ДЕФИНИЦИИ
           </div>
           <div className="privacy_policy_page__info-container--p"></div>

           <div className="privacy_policy_page__info-container--p">Чл. 3. За целите на настоящите Правила, използваните понятия имат следното значение:</div>

           <div className="privacy_policy_page__info-container--p">
           <ul>
                <li><span className="privacy_policy_page__info-container--p--bold">{"ЗЗЛД"}</span> - Закон за защита на личните данни.</li>
                <li><span className="privacy_policy_page__info-container--p--bold">{"КЗЛД"}</span> - Комисия за защита на личните данни.</li>
                <li><span className="privacy_policy_page__info-container--p--bold">{"ОРЗД"}</span> - Регламент (ЕС) 2016/679 на Европейския парламент и на Съвета от 27 април 2016 г. относно защитата на физическите лица във връзка с обработването на лични данни и относно свободното движение на такива данни и за отмяна на Директива 95/46/EО (Общ регламент относно защитата на данните).</li>
                <li><span className="privacy_policy_page__info-container--p--bold">{"Длъжностно лице по защита на данните"}</span> - физическо лице или организация, определени съгласно изискванията на чл. 37 и сл. от ОРЗД.</li>
                <li><span className="privacy_policy_page__info-container--p--bold">{"Лице, отговорно за личните данни"}</span> -  лице, което е служител в дружеството или изпълнява функции по поръчение, на което са възложени задълженията във връзка със защитата и процесите по обработка на лични данни, уредени в тези Правила.</li>
            </ul>
            Основните дейности на администратора или обработващия лични данни не се състоят в операции по обработване, които поради своето естество, обхват и/или цели изискват редовно и систематично мащабно наблюдение на субектите на данни или в мащабно обработване на специалните категории данни и на лични данни, свързани с присъди и нарушения. С оглед това обстоятелство, Дружеството няма задължение да назначи длъжностно лице по защита на данните и не следва да се счита, че Дружеството е назначило такова лице или че лицето, отговорно за личните данни, има задълженията и следва да отговаря на изискванията на лицето по смисъла на чл. 37 и сл. от ОРЗД.]
            <ul>
                <li><span className="privacy_policy_page__info-container--p--bold">{"Администратор на лични данни"}</span> - физическо или юридическо лице, публичен орган, агенция или друга структура, която сама или съвместно с други определя целите и средствата за обработването на лични данни.</li>
                <li><span className="privacy_policy_page__info-container--p--bold">{"Обработващ лични данни"}</span> - лице или организация, което въз основа на договор обработва лични данни, предоставени от Дружеството, за уговорените цели.</li>
                <li><span className="privacy_policy_page__info-container--p--bold">{"Обработване на данни"}</span> - всяка дейност, която е свързана с използването на лични данни. Това включва: получаване, записване, съхранение, извършване на операция или серия от операции с данните като напр. организиране, редактиране, възстановяване, използване, предоставяне, изтриване или унищожаване. Обработването също включва и трансфер на лични данни до трети лица.</li>
                <li><span className="privacy_policy_page__info-container--p--bold">{"Съгласие"}</span> - всяко свободно изразено, конкретно, информирано и недвусмислено указание за волята на субекта на данни, посредством изявление или ясно потвърждаващо действие, което изразява съгласие за обработка на лични данни, свързани с него.</li>
            </ul>
           </div>




           <div className="privacy_policy_page__info-container--p--bolditalic">
           СУБЕКТИ НА ДАННИ И КАТЕГОРИИ ЛИЧНИ ДАННИ
           </div>
           <div className="privacy_policy_page__info-container--p"></div>

           <div className="privacy_policy_page__info-container--p">Чл. 4. (1) Дружеството събира и обработва лични данни, необходими за осъществяване на своите права и задължения като работодател, доставчик на услуги и функционалности при съблюдаване изискванията на действащото законодателство. Личните данни, обработ-вани от Дружеството, са групирани в регистри на дейностите по обработване, съдържащи правила за обработване на лични данни, отнасящи се до:</div>

           <div className="privacy_policy_page__info-container--p">
           <ul>
                <li>работници и служители и изпълнители по граждански договори;</li>
                <li>кандидати за работа;</li>
            </ul>
           </div>

           <div className="privacy_policy_page__info-container--p">(2) Относно лицата, заети по трудови или граждански правоотношения в Дружест-вото, и на кандидатите за работа, се събират следните лични данни:</div>

           <div className="privacy_policy_page__info-container--p">{"a) Идентификация: име; ЕГН (дата на раждане), постоянен и/или настоящ адрес, телефон, данни по лична карта или паспортни данни;"}</div>

           <div className="privacy_policy_page__info-container--p">{"б) Образование и професионална квалификация: данни, свързани с образование, трудов опит, професионална и лична квалификация и умения;"}</div>

           <div className="privacy_policy_page__info-container--p">{"в) Здравни данни: здравословно състояние, ТЕЛК решения, медицински свидетелства, болнични листове и всяка прилежаща към тях документация;"}</div>

           <div className="privacy_policy_page__info-container--p">{"г) Други данни: свидетелство за съдимост, когато се изисква представянето му съгласно нормативен акт, както и други данни, чието обработване е необходимо за изпълнение на правата и задълженията на Дружеството като работодател."}</div>





           <div className="privacy_policy_page__info-container--p--bolditalic">
           ЦЕЛИ И ПРИНЦИПИ НА ОБРАБОТВАНЕ НА ЛИЧНИТЕ ДАННИ
           </div>
           <div className="privacy_policy_page__info-container--p"></div>

           <div className="privacy_policy_page__info-container--p">Чл. 5. Целите на обработването на лични данни са:</div>

           <div className="privacy_policy_page__info-container--p">(1) управление на човешките ресурси, изплащане на трудовите възнаграждения и изпълнение на свързаните с това задължения на работодателя за удържане и плащане на здравни и социални осигуровки на служителите, на данъци, както и на други права и задължения на Дружеството в качеството му на работодател;</div>


           <div className="privacy_policy_page__info-container--p">Чл. 6. Личните данни се обработват законосъобразно, добросъвестно и прозрачно при спазване на следните принципи:</div>

           <div className="privacy_policy_page__info-container--p">(1) Субектът на данните се информира предварително за обработването на неговите лични данни;</div>

           <div className="privacy_policy_page__info-container--p">(2) Личните данни се събират за конкретни, точно определени и законни цели и не се обработват допълнително по начин, несъвместим с тези цели;</div>

           <div className="privacy_policy_page__info-container--p">(3) Личните данни съответстват на целите, за които се събират;</div>

           <div className="privacy_policy_page__info-container--p">(4) Личните данни трябва да са точни и при необходимост да се актуализират;</div>

           <div className="privacy_policy_page__info-container--p">(5) Личните данни се заличават или коригират, когато се установи, че са неточни или не съответстват на целите, за които се обработват;</div>

           <div className="privacy_policy_page__info-container--p">(6) Личните данни се поддържат във вид, който позволява идентифициране на съответните физически лица за период, не по-дълъг от необходимия, за целите, за които тези данни се обработват.</div>


           <div className="privacy_policy_page__info-container--p">Чл. 7. За да е законосъобразно обработването на данните, трябва да е налице поне едно от следните условия:</div>

           <div className="privacy_policy_page__info-container--p">(1) Субектът на данните е дал своето съгласие;</div>

           <div className="privacy_policy_page__info-container--p">(2) Обработването е необходимо за спазването на законово задължение, което се прилага спрямо администратора;</div>

           <div className="privacy_policy_page__info-container--p">(3) Обработването е необходимо, за да се защитят жизненоважни интереси на субекта на данните или на друго физическо лице;</div>

           <div className="privacy_policy_page__info-container--p">(4) Обработването е необходимо за изпълнение на задача от обществен интерес;</div>





           <div className="privacy_policy_page__info-container--p--bolditalic">
           СЪГЛАСИЕ
           </div>
           <div className="privacy_policy_page__info-container--p"></div>


           <div className="privacy_policy_page__info-container--p">Чл. 8. (1) Субектът на данни е съгласен с обработването, ако изрази това ясно и недвусмислено – чрез изявление или друг потвърждаващ акт. Ако съгласието за обработка на лични данни се дава чрез документ, който урежда и други въпроси, то следва да бъде изискано отделно от съгласието по други въпроси.</div>

           <div className="privacy_policy_page__info-container--p">(2) Субектите на данни трябва да могат лесно да оттеглят съгласието си за обработване по всяко време, и оттеглянето трябва да бъде уважено своевременно. Ако не съществува друго условие за законосъобразност на обработването, с оттеглянето на съгласието то следва да се прекрати.</div>




           <div className="privacy_policy_page__info-container--p--bolditalic">
           ПРОЦЕДУРИ ПО ОБРАБОТВАНЕ НА ЛИЧНИТЕ ДАННИ
           </div>
           <div className="privacy_policy_page__info-container--p"></div>


           <div className="privacy_policy_page__info-container--p">Процедура за обработване на личните данни, отнасящи се до лицата, заети по трудови или граждански правоотношения в дружеството, както и на кандидатите за работа</div>

           <div className="privacy_policy_page__info-container--p">Чл. 9. (1) Личните данни, отнасящи се до лицата, заети по трудови или граждански право-отношения в Дружеството, както и на кандидатите за работа, се събират при и по повод набирането на персонал. Данните на всеки работник и служител на Дружеството се съхраняват в лични досиета, като някои данни могат да се съхраняват или обработват и на технически носител. Данните от проведени конкурси и интервюта се съхраняват на технически и/или хартиен носител, в зависимост от нуждата.</div>

           <div className="privacy_policy_page__info-container--p">(2) Личните досиета се подреждат в специални картотечни шкафове със заключване, находящи се в кабинета на Лицето, отговорно за личните данни. Данните на кандидатите за работа, които се съхраняват на хартиен носител, се съхраняват в нарочни шкафове в кабинета на Лицето, отговорно за личните данни. Достъпът до кабинета се предоставя само на лицата, оправомощени да обработват личните данни, като за целта се създава специален ред за влизане в помещението чрез ключ, магнитна карта или друго подходящо средство и/или устройство.</div>

           <div className="privacy_policy_page__info-container--p">(3) Лицата, оправомощени да обработват лични данни, предприемат всички организационно-технически мерки за съхраняването и опазването на личните досиета и класьорите с информация, в това число ограничаване на достъпа до тях на външни лица и неоторизирани служители.</div>

           <div className="privacy_policy_page__info-container--p">(4) Досиета на работниците и служителите, както и данните на кандидатите за работа, не се изнасят извън сградата на дружеството.</div>



           <div className="privacy_policy_page__info-container--p--bolditalic">
           ДОКУМЕНТИРАНЕ НА ОБРАБОТКАТА НА ЛИЧНИ ДАННИ
           </div>
           <div className="privacy_policy_page__info-container--p"></div>


           <div className="privacy_policy_page__info-container--p">Чл. 11. (1) Дружеството документира дейностите по обработване на лични данни при спазване на принципа на отчетност.</div>

           <div className="privacy_policy_page__info-container--p">(2) Документацията трябва да е достатъчна, за да докаже спазването на принципите за законосъобразно обработване на личните данни.</div>

           <div className="privacy_policy_page__info-container--p">(3) Обработването на данни, свързано с предаване на данни на обработващи, установени в страната или чужбина; съхранение на данни на сървъри, собственост на трети лица; архивиране или изтриване на данни; въвеждане на псевдонимизация, както и всяка друга обработка, чиито параметри са различни от описаните в тези правила, се документира чрез създаване на протоколи, които съдържат следната информация:</div>

           <div className="privacy_policy_page__info-container--p">{"(а) целите на обработването;"}</div>

           <div className="privacy_policy_page__info-container--p">{"(б) категориите лични данни и категориите субекти на данни;"}</div>

           <div className="privacy_policy_page__info-container--p">{"(в) категориите получатели, пред които са или ще бъдат разкрити личните данни, включително получателите в трети държави;"}</div>

           <div className="privacy_policy_page__info-container--p">{"(г) предаването на лични данни на трета държава;"}</div>

           <div className="privacy_policy_page__info-container--p">{"(д) когато е възможно, предвидените срокове за изтриване на различните категории данни;"}</div>

           <div className="privacy_policy_page__info-container--p">{"(е) общо описание на техническите и организационни мерки за сигурност."}</div>

           <div className="privacy_policy_page__info-container--p">{"(4) Протоколите се изготвят от лицата, които извършват съответната обработка на данни по указания от Лицето, отговорно за личните данни."}</div>

           <div className="privacy_policy_page__info-container--p">{"(5) Съвкупността от всички протоколи, съдържащи гореописаната информация, съставлява регистъра на дейностите по обработването, съгласно чл. 30 от ОРЗД."}</div>






           <div className="privacy_policy_page__info-container--p--bolditalic">
           ДОКУМЕНТИРАНЕ НА ОБРАБОТКАТА НА ЛИЧНИ ДАННИ
           </div>
           <div className="privacy_policy_page__info-container--p"></div>


           <div className="privacy_policy_page__info-container--p">Технически мерки</div>

           <div className="privacy_policy_page__info-container--p">Чл. 12. (1) Всички помещения, в които се съхраняват и обработват лични данни, са с контрол на достъпа. Възможните технически средства за контрол на достъпа са:</div>

           <div className="privacy_policy_page__info-container--p">– охрана на помещенията;</div>

           <div className="privacy_policy_page__info-container--p">– устройства за разпознаване чрез магнитна карта и/или ключ;</div>

           <div className="privacy_policy_page__info-container--p">– политика на допускане на външни лица до помещенията на дружеството само с придружител от персонала на дружеството.</div>

           <div className="privacy_policy_page__info-container--p">(2) Помещенията на дружеството са надеждно обезопасени посредством противопожарни мерки съгласно българското законодателство.</div>

           <div className="privacy_policy_page__info-container--p">Мерки за документална защита</div>

           <div className="privacy_policy_page__info-container--p">Чл. 13. (1) Дружеството установява процедури по обработване на лични данни, регламен-тиране на достъпа до данните, процедури по унищожаване и срокове за съхранение, подробно разписани в тези Правила. За отделни категории данни може да се предвиди псевдонимизиране по предложение на Лицето, отговорно за личните данни.</div>

           <div className="privacy_policy_page__info-container--p">(2) Размножаването и разпространението на документи или файлове, съдържащи лични данни, се извършва само и единствено от упълномощени служители при възникнала необходимост.</div>

           <div className="privacy_policy_page__info-container--p">Персонални мерки на защита</div>

           <div className="privacy_policy_page__info-container--p">Чл. 14. (1) Преди заемане на съответната длъжност лицата, които осъществяват защита и обработване на личните данни:</div>

           <div className="privacy_policy_page__info-container--p">– поемат задължение за неразпространение на личните данни, до които имат достъп;</div>

           <div className="privacy_policy_page__info-container--p">– се запознават с нормативната база, вътрешните правила и политики на дружеството относно защитата на личните данни;</div>

           <div className="privacy_policy_page__info-container--p">- преминават обучение за реакция при събития, застрашаващи сигурността на данните;</div>

           <div className="privacy_policy_page__info-container--p">– са инструктирани за опасностите за личните данни, които се обработват от дружеството;</div>

           <div className="privacy_policy_page__info-container--p">– се задължават да не споделят критична информация помежду си и с външни лица, освен по установения с тези Правила ред.</div>




           <div className="privacy_policy_page__info-container--p--bolditalic">
           НАРУШЕНИЯ НА СИГУРНОСТТА
           </div>
           <div className="privacy_policy_page__info-container--p"></div>


           <div className="privacy_policy_page__info-container--p">Чл. 17. (1) Лицата, идентифицирали признаци на нарушение на сигурността на данните, са длъжни да докладват незабавно на Лицето, отговорно за личните данни, като му предоста-вят цялата налична информация.</div>

           <div className="privacy_policy_page__info-container--p">(2) Лицето, отговорно за личните данни, извършва незабавно проверка по подадения сигнал, като се опитва да установи дали е осъществено нарушение на сигурността и кои данни са засегнати.</div>

           <div className="privacy_policy_page__info-container--p">(3) След съгласуване с ръководството на дружеството, Лицето, отговорно за личните данни, предприема мерки за предотвратяване или намаляване последиците от пробива и възможностите за възстановяване на данните.</div>







           <div className="privacy_policy_page__info-container--p--bolditalic">
           ПРЕДОСТAВЯНЕ НА ЛИЧНИ ДАННИ НА ТРЕТИ ЛИЦА
           </div>
           <div className="privacy_policy_page__info-container--p"></div>


           <div className="privacy_policy_page__info-container--p">Чл. 20. (1) Дружеството може при необходимост да предоставя лични данни на трети лица, действащи в качеството на обработващ, въз основа на изричен договор.</div>






           <div className="privacy_policy_page__info-container--p--bolditalic">
           ОЦЕНКА НА ВЪЗДЕЙСТВИЕТО ВЪРХУ ЗАЩИТАТА НА ДАННИТЕ
           </div>
           <div className="privacy_policy_page__info-container--p"></div>


           <div className="privacy_policy_page__info-container--p">Чл. 21. (1) Оценка на въздействието се извършва, когато това се изисква от действащото законодателство и с оглед на риска за физическите лица и естеството на обработка на лични данни, извършвана от Дружеството. Оценка на въздействието се извършва за високорискови дейности по обработване.</div>

           <div className="privacy_policy_page__info-container--p">(2) Оценка на въздействието е необходимо при всяко въвеждане на ключова система или смяна на бизнес програма, която е</div>

           <div className="privacy_policy_page__info-container--p">– първоначалното въвеждане на нови технологии или прехода към нови технологии;</div>

           <div className="privacy_policy_page__info-container--p">– автоматизирано обработване, включително профилиране или автоматизирано вземане на решения;</div>

           <div className="privacy_policy_page__info-container--p">– обработване на чувствителни лични данни в голям мащаб;</div>

           <div className="privacy_policy_page__info-container--p">– мащабно, систематично наблюдение на публично обществена зона.</div>

           <div className="privacy_policy_page__info-container--p">(3) За оценката се съставя протокол, който се предоставя при поискване на КЗЛД.</div>





           <div className="privacy_policy_page__info-container--p--bolditalic">
           УНИЩОЖАВАНЕ НА ДАННИТЕ
           </div>
           <div className="privacy_policy_page__info-container--p"></div>



           <div className="privacy_policy_page__info-container--p">Чл. 22. (1) Унищожаване на личните данни се извършва от Дружеството или изрично упълномощено лице, без да бъдат накърнявани правата на лицата, за които се отнасят данните, обект на унищожаване, при спазване на разпоредбите на относимите нормативни актове.</div>

           <div className="privacy_policy_page__info-container--p">(2) Информацията в регистрите се унищожава след постигане на целите на обработката и при отпаднала необходимост за съхранение.</div>

           <div className="privacy_policy_page__info-container--p">(3) Унищожаването на данни на хартиен носител се извършва чрез нарязване с шредер машина или изгаряне. Електронните данни се изтриват от електронната база данни по начин, непозволяващ възстановяване на информацията.</div>






           <div className="privacy_policy_page__info-container--p--bolditalic">
           ЛИЦА, ОТГОВАРЯЩИ ЗА СЪБИРАНЕТО, ОБРАБОТКАТА И СЪХРАНЕНИЕТО НА ЛИЧНИТЕ ДАННИ И ДОСТЪП ДО ЛИЧНИ ДАННИ
           </div>
           <div className="privacy_policy_page__info-container--p"></div>


           <div className="privacy_policy_page__info-container--p">Чл. 23. Лицето, отговорно за личните данни, и лицата, обработващи лични данни от името на дружеството, са физически лица, притежаващи необходимата компетентност и назначени със съответен писмен акт, включително и чрез настоящите Правила.</div>

           <div className="privacy_policy_page__info-container--p">Чл. 24. Лицето, отговорно за личните данни:</div>

           <div className="privacy_policy_page__info-container--p">– подпомага Дружеството и лицата, обработващи личните данни при изпълняване на задълженията им по защита на личните данни, като осигурява прилагането и поддържа необходимите технически и организационни мерки и средства за осъществяване на защитата на данните;</div>

           <div className="privacy_policy_page__info-container--p">– осъществява контрол през целия процес на събиране и обработване на данните;</div>

           <div className="privacy_policy_page__info-container--p">– изпълнява всички задължения по докладване и управление на нарушения на сигурността на данните;</div>

           <div className="privacy_policy_page__info-container--p">– уведомява Дружеството своевременно за всички нередности, установени във връзка с изпълнение на задълженията му;</div>

           <div className="privacy_policy_page__info-container--p">– унищожава данните от хартиените и техническите носители съгласно закона и сроковете, установени в тези Правила;</div>

           <div className="privacy_policy_page__info-container--p">Чл. 25. (1) Събирането, обработката, съхранението и защитата на личните данни се извършва само от лица, на които това е изрично указано и чиито служебни задължения или конкретно възложена задача налагат това.</div>






           <div className="privacy_policy_page__info-container--p--bolditalic">
           ПРАВА НА СУБЕКТИТЕ НА ДАННИ
           </div>
           <div className="privacy_policy_page__info-container--p"></div>


           <div className="privacy_policy_page__info-container--p">Чл. 26. (1) Всяко лице има право да иска достъп до своите лични данни, включително и да иска потвърждение дали данните, отнасящи се до него, се обработват, да се информира за целите на това обработване, категориите данни и за получателите на данните, както и за целите на всяко обработване на лични данни, отнасящи се до него.</div>

           <div className="privacy_policy_page__info-container--p">(2) Всяко физическо лице има право да иска заличаването, коригирането или блокирането на негови лични данни, обработването на които не отговаря на изискванията на закона.</div>

           <div className="privacy_policy_page__info-container--p">(3) Всяко лице има право писмено да възрази срещу обработването и/или предоставянето на трети лица на неговите лични данни без необходимото законово основание.</div>

           <div className="privacy_policy_page__info-container--p">(6) Субектите на данни имат също правото да:</div>

           <div className="privacy_policy_page__info-container--p">– възразят срещу употреба на личните им данни за целите на директния маркетинг;</div>

           <div className="privacy_policy_page__info-container--p">– възразят срещу решение, взето изцяло на база на автоматизирано обработване, включително профилиране;</div>

           <div className="privacy_policy_page__info-container--p">– бъдат уведомени за нарушение на защита на данните, което е вероятно да доведе до висок риск за техните права и свободи;</div>

           <div className="privacy_policy_page__info-container--p">– подават жалби до регулаторния орган;</div>





           <div className="privacy_policy_page__info-container--p--bolditalic">
           ПРОМЕНИ НА ВЪТРЕШНИТЕ ПРАВИЛА
           </div>
           <div className="privacy_policy_page__info-container--p"></div>


           <div className="privacy_policy_page__info-container--p">Чл. 27. Дружеството може да променя тези Правила по всяко време. Всички промени следва да бъдат незабавно сведени до знанието на лицата, които засягат.</div>




           <div className="privacy_policy_page__info-container--p">Варна, 26.06.2024г.</div>

           <div className="privacy_policy_page__info-container--p">Тодор Йорданов</div>

           <div className="privacy_policy_page__info-container--p">Разработчик на Disaster Scout</div>


        </div>

  </div>
  
  );
  
};