import { useEffect } from "react";
import './terms_of_use_page.scss';

export const TermsOfUsePage = () => {

  //? Cleanup effect to reset scroll position when component unmounts
  useEffect(() => {
    return () => {
      window.scroll({ top: 0, behavior: 'auto' });
    };
  }, []);

    return (
      <div className="terms_of_use_page">
        
        <div className="terms_of_use_page__title">
          Общи условия за ползване на услугите на 
          <span className="terms_of_use_page__title--disaster">DISASTER</span>
          <span className="terms_of_use_page__title--scout">SCOUT</span>
        </div>

        <div className="terms_of_use_page__info-container"> 
           <div className="terms_of_use_page__info-container--p">ВНИМАНИЕ! Внимателно прочетете тези условия, преди да използвате това уеб приложение. Ако използвате това уеб приложение се счита, че приемате и сте съгласни с тези условия. Ако НЕ ПРИЕМАТЕ тези условия, не използвайте това уеб приложение!</div>
        
           <div className="terms_of_use_page__info-container--p">Настоящите ОБЩИ УСЛОВИЯ уреждат взаимоотношенията между уеб приложението от една страна и потребителите на електронни (Интернет) страници и услуги, които са част от Disaster Scout.</div>
        
           <div className="terms_of_use_page__info-container--p">Тези условия обвързват всички потребители. С натискането на всеки един обект, линк или бутон, разположени на страниците на Disaster Scout (с изключение на линка към настоящите Общи условия), потребителят се съгласява, изцяло приема и се задължава да спазва настоящите Общи условия.</div>
        
           







           <div className="terms_of_use_page__info-container--p">
           <span className="terms_of_use_page__info-container--p--bolditalic">{"I. ПРЕАМБЮЛ - "}</span> 
           изброените по-долу понятия се използват в настоящите Общи условия със следния смисъл:
           </div>

           <div className="terms_of_use_page__info-container--p">
           <span className="terms_of_use_page__info-container--p--bold">{"1. „Потребител“ - "}</span> 
           всички дееспособни физически (на/над 18 годишна възраст) и/или юридически лица, както и неперсонифицирани обединения, които достъпват уеб приложението Disaster Scout и се възползват от предлаганите услуги и функционалности, в това число и потребители, попадащи под закрилата на ЗЗП.
           </div>

           <div className="terms_of_use_page__info-container--p">
           <span className="terms_of_use_page__info-container--p--bold">{"2. „Потребител, попадащ под закрилата на ЗЗП“ - "}</span> 
           е всяко физическо лице, което придобива стоки или ползва услуги, които не са предназначени за извършване на търговска или професионална дейност, и всяко физическо лице, което като страна по договор по този закон действа извън рамките на своята търговска или професионална дейност.
           </div>

           <div className="terms_of_use_page__info-container--p">
           <span className="terms_of_use_page__info-container--p--bold">{"3. „Регистриран потребител“ - "}</span> 
           всеки потребител, който има достъп до системата за управление на съдържанието на Disaster Scout. Такъв потребител може да се възприема и като служител, отговарящ за качеството и достоверността на предоставената информация в уеб приложението.  Ролята на такъв потребител може да бъде диспечер или администратор.
           </div>

           <div className="terms_of_use_page__info-container--p">
           <span className="terms_of_use_page__info-container--p--bold">{"4. „Доклад“ - "}</span> 
            това е информация за прирородно бедствие или авария, систематизирана под формата на обява, съдъражаща типа бедствие или авария, подробно описание, ниво на опасност, изображение, дати и часове описващи времевия период на валидност, област, район и координати или линк към точно местоположение в Google Maps.
           </div>

           <div className="terms_of_use_page__info-container--p">
           <span className="terms_of_use_page__info-container--p--bold">{"5. „Област“ - "}</span> 
            това понятие отговаря на площ от територията на Република България, която граничи с други области, държави, море или реки.
           </div>

           <div className="terms_of_use_page__info-container--p">
           <span className="terms_of_use_page__info-container--p--bold">{"6. „Предупреждение за опасност“ - "}</span> 
            това е информация за събитие или явление с негативен характер, което предстои да случи, случва се или е възможно да се случи на територията на една или повече области на Република България.
           </div>







           <div className="terms_of_use_page__info-container--p">
           <span className="terms_of_use_page__info-container--p--bolditalic">{"II. ПРЕДМЕТ НА ОБЩИТЕ УСЛОВИЯ"}</span> 
           </div>

           <div className="terms_of_use_page__info-container--p">
           <ol>
                <li>С настоящите Общи условия се уреждат условията и редът за предоставяне уеб услуги и функционалности, извършвани от Disaster Scout,  при стриктно спазване от страна на Потребителя на изискванията, посочени в настоящите Общи условия.</li>
                <li>Disaster Scout не носи отговорност за каквито и да са смущения или технически проблеми, осуетяващи възможността за използване на уеб услуги, в резултат от експлоатирането на каквото и да било компютърното оборудване от Потребителя.</li>
                <li>При извършване на промени в Общите условия, Disaster Scout се задължава да публикува в уеб приложението актуалния текст на измененията.</li>
                <li>Чрез приемането на тези Общи условия, Потребителят се съгласява да ги спазва без никакви изключения.</li>
            </ol>
           </div>






           <div className="terms_of_use_page__info-container--p">
           <span className="terms_of_use_page__info-container--p--bolditalic">{"III. ПРАВО НА ИНТЕЛЕКТУАЛНА СОБСТВЕНОСТ"}</span> 
           </div>

           <div className="terms_of_use_page__info-container--p">
           <ol>
                <li>Потребителят няма право да използва уебприложението за изпращане или предаване на каквито и да е материали с противозаконно, заплашително, невярно, подвеждащо, оскърбително, малтретиращо, опозоряващо, оклеветяващо, вулгарно, неприлично, скандално, подстрекаващо, порнографско или религиозно некоректно съдържание, или каквито и да е материали, които установяват или окуражават поведение, което би било сметнато за криминално престъпление, би довело до гражданска или наказателна отговорност или по друг начин би нарушило закона.</li>
                <li>Цялото съдържание на Уеб приложението включително текстова част, рисунки, графики, снимки, бази данни, дизайн, видео, марки, софтуерни програми, лого, слогани и друга информация, представляват обект на авторско право по смисъла на Закона за авторското право и сродните му права и са притежание на Disaster Scout и/или неговите партньори, клиенти или на потребители, предоставили за публикуване съответните материали.</li>
            </ol>
           </div>







           <div className="terms_of_use_page__info-container--p">
           <span className="terms_of_use_page__info-container--p--bolditalic">{"IV. ИЗПОЛЗВАНЕ НА УЕБСАЙТА"}</span> 
           </div>

           <div className="terms_of_use_page__info-container--p">
           <ol>
                <li>При изпращане на Доклад, Потребителят попълва форма, в която въвежда следната информация: тип бедствие / авария, ниво на опасност, времетраене, подробно описание, област, район, адрес(не е задължително), координати или линк към местоположение в Google Maps, име, иамилия, мобилен номер, изображение(не е задължително).</li>
                <li>За използването на Уеб приложението Disaster Scout, Потребителят се задължава да предоставя вярна, точна и актуална информация. Disaster Scout не носи отговорност за некоректно попълнени от Потребителя данни при изпращане на доклад за природно бедствие или авария.</li>
                <li>След успешно изпращане на доклад за природно бедствие или авария, потребителят получава прозвъняване от диспечер на предоставеният мобилен номер, за уточняване на подробности.</li>
                <li>Disaster Scout не носи отговорност за каквито и да е щети и загуби, възникнали поради неспазване на разпоредбите на настоящия раздел.</li>
            </ol>
           </div>



        </div>

  </div>
  
  );
  
};